blog_app/app/controllers/articles_controller.rb

INSERT INTO "articles" ("name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "chuchu"], ["body", "chuchu"], ["created_at", "2021-07-15 15:25:15.321974"], ["updated_at", "2021-07-15 15:25:15.321974"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save!