app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save!
---
INSERT INTO "articles" ("name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "chuchu"], ["body", "chuchu"], ["created_at", "2021-07-20 14:41:36.044488"], ["updated_at", "2021-07-20 14:41:36.044488"]]

  def update
    # raise params.inspect - prints out params on error page
    @article.update!(article_params)
---
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3